espruino/Espruino/targets/efm32/jshardware.c
/**
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2013 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * Platform Specific part of Hardware interface Layer
 * ----------------------------------------------------------------------------
 */
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>

#include "jshardware.h"
#include "jstimer.h"
#include "jsutils.h"
#include "jsparse.h"
#include "jsinteractive.h"
#include "jswrap_io.h"
#include "jswrap_date.h" // for non-F1 calendar -> days since 1970 conversion.

#include "em_chip.h"
#include "em_cmu.h"
#include "em_emu.h"
#include "em_int.h"
#include "em_rtc.h"
#include "em_timer.h"
#include "em_usart.h"
#include "em_gpio.h"
#include "rtcdriver.h"
#include "nvm_hal.h"
#include "gpiointerrupt.h"

#define SYSCLK_FREQ 48000000 // Using standard HFXO freq
#define USE_RTC

//---------------------- RTC/clock ----------------------------/
#define RTC_INITIALISE_TICKS 4 // SysTicks before we initialise the RTC - we need to wait until the LSE starts up properly
#define JSSYSTIME_SECOND_SHIFT 20
#define JSSYSTIME_SECOND  (1<<JSSYSTIME_SECOND_SHIFT) // Random value we chose - the accuracy we're allowing (1 microsecond)
#define JSSYSTIME_MSECOND (1<<JSSYSTIME_SECOND_SHIFT)/1000
#define JSSYSTIME_USECOND (1<<JSSYSTIME_SECOND_SHIFT)/1000000

volatile uint32_t ticksSinceStart = 0;
#ifdef USE_RTC
// Average time between SysTicks
volatile uint32_t averageSysTickTime=0, smoothAverageSysTickTime=0;
// last system time there was a systick
volatile JsSysTime lastSysTickTime=0, smoothLastSysTickTime=0;
// whether we have slept since the last SysTick
bool hasSystemSlept = true;
RTCDRV_TimerID_t sleepTimer;
#else
volatile JsSysTime SysTickMajor = SYSTICK_RANGE;
#endif

JsSysTime jshGetRTCSystemTime();
static JsSysTime jshGetTimeForSecond() {
#ifdef USE_RTC
  return (JsSysTime)JSSYSTIME_SECOND;
#else
  return SYSCLK_FREQ;
#endif
}

/**************************************************************************//**
 * @brief SysTick IRQ Handler
 *****************************************************************************/
void SysTick_Handler(void)
{
  jshDoSysTick();
}



//---------------------- timers ----------------------------/

int64_t utilTicks = 0;
int64_t delayTicks = 0;

/**************************************************************************//**
 * @brief TIMER0 interrupt handler for utility timer
 *****************************************************************************/
void TIMER0_IRQHandler(void) {
  uint32_t flags = TIMER_IntGet(TIMER0);
  if (flags & TIMER_IF_CC0) {
    utilTicks -= (utilTicks & 0xFFFF);
    if (utilTicks > 0) {
      TIMER_CompareSet(TIMER0, 0, TIMER_CounterGet(TIMER0) + (utilTicks & 0xFFFF));
    }
    else {
      jstUtilTimerInterruptHandler();
    }
    TIMER_IntClear(TIMER0, TIMER_IFC_CC0);
  }
  else if (flags & TIMER_IF_CC1) {
    delayTicks -= (delayTicks & 0xFFFF);
    if (delayTicks > 0) {
      TIMER_CompareSet(TIMER0, 1, TIMER_CounterGet(TIMER0) + (utilTicks & 0xFFFF));
    }
    TIMER_IntClear(TIMER0, TIMER_IFC_CC1);
  }
}



//---------------------- UART for console ----------------------------/
static USART_TypeDef           * usart0   = USART0;
static USART_TypeDef           * usart1   = USART1;
static USART_TypeDef           * usart2   = USART1;
static USART_TypeDef           * uart0    = UART0;
static USART_TypeDef           * uart1    = UART1;

/**************************************************************************//**
 * @brief UART1 RX IRQ Handler for console
 *****************************************************************************/
void USART1_RX_IRQHandler(void)
{
  /* Check for RX data valid interrupt */
  if (usart1->IF & UART_IF_RXDATAV)
  {
    /* Clear the USART Receive interrupt */
    USART_IntClear(usart1, UART_IF_RXDATAV);
    
    /* Read one byte from the receive data register */
    jshPushIOCharEvent(EV_SERIAL2, (char)USART_Rx(usart1));
  }
}

/**************************************************************************//**
 * @brief UART1 TX IRQ Handler for console
 *****************************************************************************/
void USART1_TX_IRQHandler(void)
{
  /* Check TX buffer level status */
  if (usart1->IF & UART_IF_TXBL)
  {
    /* If we have other data to send, send it */
    int c = jshGetCharToTransmit(EV_SERIAL2);
    if (c >= 0) {
      USART_Tx(usart1, (uint8_t)c);
    } else
      USART_IntDisable(usart1, UART_IEN_TXBL);
  }
}

void jshInit() {
  
  CHIP_Init(); //Init EFM32 device


  //---------------------- RTC/clock ----------------------------/
  //Start HFXO and use it as main clock
  CMU_OscillatorEnable( cmuOsc_HFXO, true, true);
  CMU_ClockSelectSet(cmuClock_HF, cmuSelect_HFXO );
  CMU_OscillatorEnable( cmuOsc_HFRCO, false, false );

  // System Clock
  SysTick_Config(SYSTICK_RANGE-1); // 24 bit
  // NVIC_SetPriority(SysTick_IRQn, IRQ_PRIOR_SYSTICK); //EFM32 TODO: Prioritize this after SPI
  NVIC_EnableIRQ(SysTick_IRQn);


  //---------------------- UART/console ----------------------------/
  jshInitDevices(); // Initialize jshSerialDevices in jsdevice.c
  JshUSARTInfo inf ;
  inf.baudRate = DEFAULT_CONSOLE_BAUDRATE;
  inf.pinRX    = DEFAULT_CONSOLE_RX_PIN;
  inf.pinTX    = DEFAULT_CONSOLE_TX_PIN;
  inf.pinCK    = PIN_UNDEFINED;
  inf.bytesize = DEFAULT_BYTESIZE;
  inf.parity   = DEFAULT_PARITY;
  inf.stopbits = DEFAULT_STOPBITS;
  inf.xOnXOff = false;
  jshUSARTSetup(DEFAULT_CONSOLE_DEVICE, &inf); // Initialize UART for communication with Espruino/terminal.


  //---------------------- GPIO ----------------------------/
  GPIOINT_Init();


  //---------------------- Utility TIMER ----------------------------/
  TIMER_Init_TypeDef timerInit     = TIMER_INIT_DEFAULT;
  TIMER_InitCC_TypeDef timerCCInit = TIMER_INITCC_DEFAULT;
  uint32_t coreClockScale;

  timerCCInit.mode = timerCCModeCompare;
  CMU_ClockEnable( cmuClock_TIMER0, true );
  TIMER_TopSet(TIMER0, 0xFFFF );
  TIMER_InitCC(TIMER0, 0, &timerCCInit);

