espruino/Espruino/targets/efm32/jshardware.c
  /* Run timer at slowest frequency that still gives less than 1 us per tick */
  timerInit.prescale = (TIMER_Prescale_TypeDef)_TIMER_CTRL_PRESC_DIV32;
  TIMER_Init(TIMER0, &timerInit );

  NVIC_ClearPendingIRQ(TIMER0_IRQn);
  NVIC_EnableIRQ(TIMER0_IRQn);
}

// When 'reset' is called - we try and put peripherals back to their power-on state
void jshReset() {

}

void jshKill() {

}

// stuff to do on idle
void jshIdle() {

  jshUSARTKick(EV_SERIAL1);
}

/// Get this IC's serial number. Passed max # of chars and a pointer to write to. Returns # of chars
int jshGetSerialNumber(unsigned char *data, int maxChars) {
  if (maxChars <= 0)
  {
    return 0;
  }
  data[0] = (unsigned char)((DEVINFO->UNIQUEL      ) & 0xFF);
  data[1] = (unsigned char)((DEVINFO->UNIQUEL >>  8) & 0xFF);
  data[2] = (unsigned char)((DEVINFO->UNIQUEL >> 16) & 0xFF);
  data[3] = (unsigned char)((DEVINFO->UNIQUEL >> 24) & 0xFF);
  data[4] = (unsigned char)((DEVINFO->UNIQUEH      ) & 0xFF);
  data[5] = (unsigned char)((DEVINFO->UNIQUEH >>  8) & 0xFF);
  data[6] = (unsigned char)((DEVINFO->UNIQUEH >> 16) & 0xFF);
  data[7] = (unsigned char)((DEVINFO->UNIQUEH >> 24) & 0xFF);
  return 8;
}

// is the serial device connected?
bool jshIsUSBSERIALConnected() {
	return false;
}

JsSysTime jshGetRTCSystemTime() {
  //EFM32 TODO: Increase accuracy
  uint32_t secs = RTCDRV_GetWallClock();
  JsSysTime time = (secs << JSSYSTIME_SECOND_SHIFT);
  return time;
}


JsSysTime jshGetSystemTime() {
#ifdef USE_RTC
  if (ticksSinceStart<=RTC_INITIALISE_TICKS)
    return jshGetRTCSystemTime(); // Clock hasn't stabilised yet, just use whatever RTC value we currently have
  if (hasSystemSlept) {
    // reset SysTick counter. This will hopefully cause it
    // to fire off a SysTick IRQ, which will reset lastSysTickTime
    SysTick->VAL = 0; // this doesn't itself fire an IRQ it seems
    jshDoSysTick();
  }
  // Try and fix potential glitch caused by rollover of SysTick
  JsSysTime last1, last2;
  unsigned int avr1,avr2;
  unsigned int sysTick;
  do {
    avr1 = smoothAverageSysTickTime;
    last1 = smoothLastSysTickTime;
    sysTick = SYSTICK_RANGE - SysTick->VAL;
    last2 = smoothLastSysTickTime;
    avr2 = smoothAverageSysTickTime;
  } while (last1!=last2 || avr1!=avr2);
  // Now work out time...
  return last2 + (((JsSysTime)sysTick*(JsSysTime)avr2)/SYSTICK_RANGE);
#else
	JsSysTime major1, major2, major3, major4;
	unsigned int minor;
	do {
	    major1 = SysTickMajor;
	    major2 = SysTickMajor;
	    minor = SysTick->VAL;
	    major3 = SysTickMajor;
	    major4 = SysTickMajor;
	} while (major1!=major2 || major2!=major3 || major3!=major4);
	return major1 - (JsSysTime)minor;
#endif
}

/// Set the system time (in ticks) - this should only be called rarely as it could mess up things like jsinteractive's timers!
void jshSetSystemTime(JsSysTime newTime) {
	jshInterruptOff();
	// NOTE: Subseconds are not set here
#ifdef USE_RTC
	RTCDRV_SetWallClock((uint32_t)(newTime>>JSSYSTIME_SECOND_SHIFT));
	hasSystemSlept = true;
#else
	SysTickMajor = newTime;
#endif

	jshInterruptOn();
	jshGetSystemTime(); // force update of the time
}
JsSysTime jshGetTimeFromMilliseconds(JsVarFloat ms) {
  return (JsSysTime)((ms*(JsVarFloat)jshGetTimeForSecond())/1000);
}

JsVarFloat jshGetMillisecondsFromTime(JsSysTime time) {
  return ((JsVarFloat)time)*1000/(JsVarFloat)jshGetTimeForSecond();
}

void jshDoSysTick() {
  /* Handle the delayed Ctrl-C -> interrupt behaviour (see description by EXEC_CTRL_C's definition)  */
  if (execInfo.execute & EXEC_CTRL_C_WAIT)
    execInfo.execute = (execInfo.execute & ~EXEC_CTRL_C_WAIT) | EXEC_INTERRUPTED;
  if (execInfo.execute & EXEC_CTRL_C)
    execInfo.execute = (execInfo.execute & ~EXEC_CTRL_C) | EXEC_CTRL_C_WAIT;

  if (ticksSinceStart!=0xFFFFFFFF)
    ticksSinceStart++;

#ifdef USE_RTC
  if (ticksSinceStart==RTC_INITIALISE_TICKS) {
    RTCDRV_Init();
    RTCDRV_AllocateTimer(&sleepTimer); // This does not have to happen here, but seems to be as good place as any
  }

  JsSysTime time = jshGetRTCSystemTime();
	if (!hasSystemSlept && ticksSinceStart>RTC_INITIALISE_TICKS) {
	  /* Ok - slightly crazy stuff here. So the normal jshGetSystemTime is now
	   * working off of the SysTick again to get the accuracy. But this means
	   * that we can't just change lastSysTickTime to the current time, because
	   * there will be an apparent glitch if SysTick happens when measuring the
	   * length of a pulse.
	   */
	  smoothLastSysTickTime = smoothLastSysTickTime + smoothAverageSysTickTime; // we MUST advance this by what we assumed it was going to advance by last time!
	  // work out the 'real' average sysTickTime
	  JsSysTime diff = time - lastSysTickTime;
	  // saturate...
	  if (diff < 0) diff = 0;
	  if (diff > 0xFFFFFFFF) diff = 0xFFFFFFFF;
	  // and work out average without overflow (averageSysTickTime*3+diff)/4
	  averageSysTickTime = (averageSysTickTime>>1) +
						   (averageSysTickTime>>2) +
						   ((unsigned int)diff>>2);
	  // what do we expect the RTC time to be on the next SysTick?
	  JsSysTime nextSysTickTime = time + (JsSysTime)averageSysTickTime;
	  // Now the smooth average is the average of what we had, and what we need to get back in line with the actual time
	  diff = nextSysTickTime - smoothLastSysTickTime;
	  // saturate...
	  if (diff < 0) diff = 0;
	  if (diff > 0xFFFFFFFF) diff = 0xFFFFFFFF;
	  smoothAverageSysTickTime = (smoothAverageSysTickTime>>1) +
								 (smoothAverageSysTickTime>>2) +
								 ((unsigned int)diff>>2);
	} else {
	  hasSystemSlept = false;
	  smoothLastSysTickTime = time;
	  smoothAverageSysTickTime = averageSysTickTime;
	  // and don't touch the real average
	}
	lastSysTickTime = time;
#else
  SysTickMajor += SYSTICK_RANGE;
#endif

  /* One second after start, call jsinteractive. This is used to swap
   * to USB (if connected), or the Serial port. */
  if (ticksSinceStart == 5) {
    jsiOneSecondAfterStartup();
  }
}
// software IO functions...
void jshInterruptOff() {
  INT_Disable();
}

void jshInterruptOn() {
  INT_Enable();
}

void jshDelayMicroseconds(int microsec) {
  if (microsec <= 0) {
    return;
  }
  utilTicks = microsec/(SYSCLK_FREQ*32);
  if (utilTicks < 2) utilTicks=2;
  if (utilTicks > 0xFFFFFFFF) utilTicks=0xFFFFFFFF;

  TIMER_IntClear(TIMER0, TIMER_IFC_CC1);
  TIMER_CompareSet(TIMER0, 1, TIMER_CounterGet(TIMER0) + (utilTicks & 0xFFFF));
  TIMER_IntEnable(TIMER0, TIMER_IEN_CC1);

  while(utilTicks > 0) {
    EMU_EnterEM1();
  }
  TIMER_IntDisable(TIMER0, TIMER_IEN_CC1);
}

void jshPinSetValue(Pin pin, bool value) {
  GPIO_Port_TypeDef port = (GPIO_Port_TypeDef) (pin >> 4); //16 pins in each Port
  pin = (pin & 0xF); //4 LSB is pin;
  if(value)
    GPIO_PinOutSet(port, pin);
  else
	GPIO_PinOutClear(port, pin);
}

bool jshPinGetValue(Pin pin) {
  GPIO_Port_TypeDef port = (GPIO_Port_TypeDef) (pin >> 4); //16 pins in each Port
  pin = (pin & 0xF); //4 LSB is pin;
  return GPIO_PinInGet(port,pin);
}

// Set the pin state
void jshPinSetState(Pin pin, JshPinState state) {
  GPIO_Port_TypeDef port = (GPIO_Port_TypeDef) (pin >> 4); //16 pins in each Port
  pin = (pin & 0xF); //4 LSB is pin;
  GPIO_Mode_TypeDef gpioMode = gpioModeDisabled; //This is also for analog pins
  uint32_t out = GPIO_PinOutGet(port, pin);

  switch (state) {
    case JSHPINSTATE_GPIO_OUT :
      gpioMode = gpioModePushPull;
      break;
    case JSHPINSTATE_GPIO_OUT_OPENDRAIN :
      gpioMode = gpioModeWiredAnd;
      break;
    case JSHPINSTATE_GPIO_IN :
      gpioMode = gpioModeInput;
      break;
    case JSHPINSTATE_GPIO_IN_PULLUP :
      gpioMode = gpioModeInputPull;
      out = 1;
      break;
    case JSHPINSTATE_GPIO_IN_PULLDOWN :
      gpioMode = gpioModeInputPull;
      out = 0;
      break;
    case JSHPINSTATE_ADC_IN :
      break;
    case JSHPINSTATE_AF_OUT :
      break;
    case JSHPINSTATE_AF_OUT_OPENDRAIN :
      break;
    case JSHPINSTATE_USART_IN :
      break;
    case JSHPINSTATE_USART_OUT :
      break;
    case JSHPINSTATE_DAC_OUT :
      break;
    case JSHPINSTATE_I2C :
      // This depends on whether we're the slave or master and which pin (SDA/SCLK)
      break;
    default : assert(0);
      break;
  }
  //jsiConsolePrintf("\nPort: %d, Pin: %d, gpioMode: %d, out: %d", port, pin, gpioMode, out);
  GPIO_PinModeSet(port, pin, gpioMode, out);
}

/** Get the pin state (only accurate for simple IO - won't return JSHPINSTATE_USART_OUT for instance).
 * Note that you should use JSHPINSTATE_MASK as other flags may have been added */
JshPinState jshPinGetState(Pin pin) {
  GPIO_Port_TypeDef port = (GPIO_Port_TypeDef) (pin >> 4); //16 pins in each Port
  pin = (pin & 0xF); //4 LSB is pin;

  GPIO_Mode_TypeDef gpioMode = gpioModeDisabled; // Also for analog pins
  JshPinState state = JSHPINSTATE_UNDEFINED;

