espruino/Espruino/targets/efm32/jshardware.c
  if (pin < 8)
    gpioMode = (GPIO_Mode_TypeDef) (BUS_RegMaskedRead(&GPIO->P[port].MODEL, 0xF << (pin * 4)) >> (pin * 4));
  else
    gpioMode = (GPIO_Mode_TypeDef) (BUS_RegMaskedRead(&GPIO->P[port].MODEH, 0xF << ((pin - 8) * 4)) >> ((pin - 8) * 4));


  switch (gpioMode) {
      case gpioModePushPull :
        state = JSHPINSTATE_GPIO_OUT;
        break;
      case gpioModeWiredAnd :
        state = JSHPINSTATE_GPIO_OUT_OPENDRAIN;
        break;
      case gpioModeInput :
        state = JSHPINSTATE_GPIO_IN;
        break;
      case gpioModeInputPull :
        if (GPIO_PinOutGet(port, pin)) state = JSHPINSTATE_GPIO_IN_PULLUP;
        else state = JSHPINSTATE_GPIO_IN_PULLUP;
        break;
      default :
        break;
    }

  //jsiConsolePrintf("\nPort: %d, Pin: %d, gpioMode: %d, state: %d", port, pin, gpioMode, state);
  return state;
}

// Returns an analog value between 0 and 1
JsVarFloat jshPinAnalog(Pin pin) {
  /* EFM32 TODO
  if (pinInfo[pin].analog == JSH_ANALOG_NONE) return NAN;

  const nrf_adc_config_t nrf_adc_config =  {
      NRF_ADC_CONFIG_RES_10BIT,
      NRF_ADC_CONFIG_SCALING_INPUT_FULL_SCALE,
      NRF_ADC_CONFIG_REF_VBG }; // internal reference
  nrf_adc_configure( (nrf_adc_config_t *)&nrf_adc_config);
  // sanity checks for nrf_adc_convert_single...
  assert(ADC_CONFIG_PSEL_AnalogInput0 == 1);
  assert(ADC_CONFIG_PSEL_AnalogInput1 == 2);
  assert(ADC_CONFIG_PSEL_AnalogInput2 == 4);
  // make reading
  return nrf_adc_convert_single(1 << (pinInfo[pin].analog & JSH_MASK_ANALOG_CH)) / 1024.0;
  */
  return 0;
}

/// Returns a quickly-read analog value in the range 0-65535
int jshPinAnalogFast(Pin pin) {
  /* EFM32 TODO
  if (pinInfo[pin].analog == JSH_ANALOG_NONE) return 0;

  const nrf_adc_config_t nrf_adc_config =  {
        NRF_ADC_CONFIG_RES_8BIT, // 8 bit for speed (hopefully!)
        NRF_ADC_CONFIG_SCALING_INPUT_FULL_SCALE,
        NRF_ADC_CONFIG_REF_VBG }; // internal reference
  nrf_adc_configure( (nrf_adc_config_t *)&nrf_adc_config);
  // sanity checks for nrf_adc_convert_single...
  assert(ADC_CONFIG_PSEL_AnalogInput0 == 1);
  assert(ADC_CONFIG_PSEL_AnalogInput1 == 2);
  assert(ADC_CONFIG_PSEL_AnalogInput2 == 4);
  // make reading
  return nrf_adc_convert_single(1 << (pinInfo[pin].analog & JSH_MASK_ANALOG_CH)) << 8;
  */
  return 0;
}

JshPinFunction jshPinAnalogOutput(Pin pin, JsVarFloat value, JsVarFloat freq, JshAnalogOutputFlags flags) {
  /* EFM32 TODO */
  return JSH_NOTHING;
} // if freq<=0, the default is used

void jshPinPulse(Pin pin, bool pulsePolarity, JsVarFloat pulseTime) {
  /* EFM32 TODO
  // ---- USE TIMER FOR PULSE
  if (!jshIsPinValid(pin)) {
       jsExceptionHere(JSET_ERROR, "Invalid pin!");
       return;
  }
  if (pulseTime<=0) {
    // just wait for everything to complete
    jstUtilTimerWaitEmpty();
    return;
  } else {
    // find out if we already had a timer scheduled
    UtilTimerTask task;
    if (!jstGetLastPinTimerTask(pin, &task)) {
      // no timer - just start the pulse now!
      jshPinOutput(pin, pulsePolarity);
      task.time = jshGetSystemTime();
    }
    // Now set the end of the pulse to happen on a timer
    jstPinOutputAtTime(task.time + jshGetTimeFromMilliseconds(pulseTime), &pin, 1, !pulsePolarity);
  }
  */
}

///< Can the given pin be watched? it may not be possible because of conflicts
bool jshCanWatch(Pin pin) {
  return false;
}

IOEventFlags jshPinWatch(Pin pin, bool shouldWatch) {
  /* EFM32 TODO */
  return JSH_NOTHING;
} // start watching pin - return the EXTI associated with it

/// Given a Pin, return the current pin function associated with it
JshPinFunction jshGetCurrentPinFunction(Pin pin) {
  /* EFM32 TODO */
  return JSH_NOTHING;
}

/// Given a pin function, set that pin to the 16 bit value (used mainly for DACs and PWM)
void jshSetOutputValue(JshPinFunction func, int value) {
  /* EFM32 TODO */
}

/// Enable watchdog with a timeout in seconds
void jshEnableWatchDog(JsVarFloat timeout) {
  /* EFM32 TODO */
}

/** Check the pin associated with this EXTI - return true if it is a 1 */
bool jshGetWatchedPinState(IOEventFlags device) {
  /* EFM32 TODO */
  return false;
}

bool jshIsEventForPin(IOEvent *event, Pin pin) {
  /* EFM32 TODO */
  return false;
}

/** Is the given device initialised? */
bool jshIsDeviceInitialised(IOEventFlags device) {
  /* EFM32 TODO */
  return false;
}

/** Set up a UART, if pins are -1 they will be guessed */
void jshUSARTSetup(IOEventFlags device, JshUSARTInfo *inf)
{
  // Initializes UART and registers a callback function defined above to read characters into the static variable character.

  USART_TypeDef* uart; // Re-mapping from Espruino to EFM32
  uint32_t rxIRQ;
  uint32_t txIRQ;
  uint32_t routeLoc = 0;

  switch(device) {
    case EV_SERIAL1:
      uart = usart0;
      rxIRQ = USART0_RX_IRQn;
      txIRQ = USART0_TX_IRQn;
      CMU_ClockEnable(cmuClock_USART0, true);
      break;
    case EV_SERIAL2:
      uart = usart1;
      rxIRQ = USART1_RX_IRQn;
      txIRQ = USART1_TX_IRQn;
      routeLoc = USART_ROUTE_LOCATION_LOC1;
      CMU_ClockEnable(cmuClock_USART1, true);
      break;
    case EV_SERIAL3:
      uart = usart2;
      rxIRQ = USART2_RX_IRQn;
      txIRQ = USART2_TX_IRQn;
      CMU_ClockEnable(cmuClock_USART2, true);
      break;
    case EV_SERIAL4:
      uart = uart0;
      rxIRQ = UART0_RX_IRQn;
      txIRQ = UART0_TX_IRQn;
      CMU_ClockEnable(cmuClock_UART0, true);
      break;
    case EV_SERIAL5:
      uart = uart1;
      rxIRQ = UART1_RX_IRQn;
      txIRQ = UART1_TX_IRQn;
      CMU_ClockEnable(cmuClock_UART1, true);
      break;
    default: assert(0);
  }
  GPIO_Port_TypeDef rxPort = (GPIO_Port_TypeDef) (inf->pinRX >> 4); //16 pins in each Port
  uint32_t rxPin = (inf->pinRX & 0xF);
  GPIO_Port_TypeDef txPort = (GPIO_Port_TypeDef) (inf->pinTX >> 4); //16 pins in each Port
  uint32_t txPin = (inf->pinTX & 0xF);

    /* Enable clock for HF peripherals */
  CMU_ClockEnable(cmuClock_HFPER, true);

  /* Enable clock for GPIO module (required for pin configuration) */
  CMU_ClockEnable(cmuClock_GPIO, true);
  /* Configure GPIO pins */
  GPIO_PinModeSet(rxPort, rxPin, gpioModeInput, 0);
  GPIO_PinModeSet(txPort, txPin, gpioModePushPull, 1);

  static USART_InitAsync_TypeDef uartInit = USART_INITASYNC_DEFAULT;

