espruino/Espruino/targets/efm32/jshardware.c
  /* Prepare struct for initializing UART in asynchronous mode*/
  uartInit.enable       = usartDisable;   /* Don't enable UART upon intialization */
  uartInit.baudrate     = inf->baudRate;

  /* Initialize USART with uartInit struct */
  USART_InitAsync(uart, &uartInit);

  /* Prepare UART Rx and Tx interrupts */
  USART_IntClear(uart, _USART_IFC_MASK);
  USART_IntEnable(uart, USART_IEN_RXDATAV);
  NVIC_ClearPendingIRQ(rxIRQ);
  NVIC_ClearPendingIRQ(txIRQ);
  NVIC_EnableIRQ(rxIRQ);
  NVIC_EnableIRQ(txIRQ);

  /* Enable I/O pins at UART1 location #1 */
  uart->ROUTE = UART_ROUTE_RXPEN | UART_ROUTE_TXPEN | routeLoc;

  /* Enable UART */
  USART_Enable(uart, usartEnable);
  GPIO_IntConfig(gpioPortD, 1, true, false, false);
}

/** Kick a device into action (if required). For instance we may need to set up interrupts */
void jshUSARTKick(IOEventFlags device) {
  
  USART_TypeDef* uart; // Re-mapping from Espruino to EFM32

  switch(device) {
    case EV_SERIAL1:
      uart = usart0;
      break;
    case EV_SERIAL2:
      uart = usart1;
      break;
    case EV_SERIAL3:
      uart = usart2;
      break;
    case EV_SERIAL4:
      uart = uart0;
      break;
    case EV_SERIAL5:
      uart = uart1;
      break;
    default: assert(0);
  }

  int check_valid_char = jshGetCharToTransmit(device);
  if (check_valid_char >= 0)
  {
    
    uint8_t character = (uint8_t) check_valid_char;
    USART_Tx(uart, character);
  }

}

/** Set up SPI, if pins are -1 they will be guessed */
void jshSPISetup(IOEventFlags device, JshSPIInfo *inf) {
  /* EFM32 TODO */
}

/** Send data through the given SPI device (if data>=0), and return the result
 * of the previous send (or -1). If data<0, no data is sent and the function
 * waits for data to be returned */
int jshSPISend(IOEventFlags device, int data) {
  /* EFM32 TODO */
  return -1;
}

/** Send 16 bit data through the given SPI device. */
void jshSPISend16(IOEventFlags device, int data) {
  /* EFM32 TODO */
}

/** Set whether to send 16 bits or 8 over SPI */
void jshSPISet16(IOEventFlags device, bool is16) {
  /* EFM32 TODO */
}

/** Set whether to use the receive interrupt or not */
void jshSPISetReceive(IOEventFlags device, bool isReceive) {
  /* EFM32 TODO */
}

/** Wait until SPI send is finished, and flush all received data */
void jshSPIWait(IOEventFlags device) {
  /* EFM32 TODO */
}

/** Set up I2C, if pins are -1 they will be guessed */
void jshI2CSetup(IOEventFlags device, JshI2CInfo *inf) {
  /* EFM32 TODO */
}

/** Addresses are 7 bit - that is, between 0 and 0x7F. sendStop is whether to send a stop bit or not */
void jshI2CWrite(IOEventFlags device, unsigned char address, int nBytes, const unsigned char *data, bool sendStop) {
  /* EFM32 TODO */
}

void jshI2CRead(IOEventFlags device, unsigned char address, int nBytes, unsigned char *data, bool sendStop) {
  /* EFM32 TODO */
}

/// Return start address and size of the flash page the given address resides in. Returns false if no page.
bool jshFlashGetPage(uint32_t addr, uint32_t * startAddr, uint32_t * pageSize)
{
  if (addr<FLASH_START || addr>=FLASH_START+FLASH_TOTAL)
    return false;
  if (startAddr)
    *startAddr = addr & (uint32_t)~(FLASH_PAGE_SIZE-1);
  if (pageSize)
    *pageSize = FLASH_PAGE_SIZE;
  return true;
}

/// Erase the flash page containing the address.
void jshFlashErasePage(uint32_t addr)
{
  uint32_t startAddr;
  uint32_t pageSize;
  if (!jshFlashGetPage(addr, &startAddr, &pageSize))
    return;
  NVMHAL_Init();
  NVMHAL_PageErase((uint8_t*) startAddr);
  NVMHAL_DeInit();
}

/**
 * Reads a byte from memory. Addr doesn't need to be word aligned and len doesn't need to be a multiple of 4.
 */
void jshFlashRead(void * buf, uint32_t addr, uint32_t len)
{
  memcpy(buf, (void*)addr, len);
}

/**
 * Writes an array of bytes to memory. Addr must be word aligned and len must be a multiple of 4.
 */
void jshFlashWrite(void * buf, uint32_t addr, uint32_t len)
{
  if ((addr & (3UL)) != 0 || (len % 4) != 0)
  {
	  return;
  }
  NVMHAL_Init();
  NVMHAL_Write((uint8_t*)addr, buf, len);
  NVMHAL_DeInit();
}

/// Enter simple sleep mode (can be woken up by interrupts). Returns true on success
bool jshSleep(JsSysTime timeUntilWake) {
#ifdef USE_RTC
  /* TODO:
       Check jsiGetConsoleDevice to make sure we don't have to wake on USART (we can't do this fast enough)
       Check that we're not using EXTI 11 for something else
       Check we're not using PWM as this will stop
       What about EXTI line 18 - USB Wakeup event
       Check time until wake against where we are in the RTC counter - we can sleep for 0.1 sec if we're 90% of the way through the counter...
   */
  //jsiConsolePrintf("\ns: %d, t: %d, R: %d, T: %d", jsiStatus, timeUntilWake, jstUtilTimerIsRunning(), jshHasTransmitData());
  if (
      (jsiStatus & JSIS_ALLOW_DEEP_SLEEP) &&
      (timeUntilWake > (jshGetTimeForSecond()/2)) &&  // if there's less time than this then we can't go to sleep because we can't be sure we'll wake in time
      !jstUtilTimerIsRunning() && // if the utility timer is running (eg. digitalPulse, Waveform output, etc) then that would stop
      !jshHasTransmitData() && // if we're transmitting, we don't want USART/etc to get slowed down
      ticksSinceStart>RTC_INITIALISE_TICKS && // Don't sleep until RTC has initialised
      true
      ) {
    jsiSetSleep(JSI_SLEEP_DEEP);
    // deep sleep!
    uint32_t ms = (uint32_t)((timeUntilWake*1000)/jshGetTimeForSecond()); // ensure we round down and leave a little time
    if (timeUntilWake!=JSSYSTIME_MAX) { // set alarm

      /* If we're going asleep for more than a few seconds,
            * add one second to the sleep time so that when we
            * wake up, we execute our timer immediately (even if it is a bit late)
            * and don't waste power in shallow sleep. This is documented in setInterval */
      if (ms>3) ms++; // sleep longer than we need

      RTCDRV_StartTimer(sleepTimer, rtcdrvTimerTypeOneshot,
                        ms, NULL, NULL);
    }
    // set flag in case there happens to be a SysTick
    hasSystemSlept = true;
    // -----------------------------------------------
    //jsiConsolePrintf("\nR: %d, t: %d%d", ms, (uint32_t)(timeUntilWake>>32), (uint32_t)timeUntilWake);
    GPIO_IntEnable(1<<1);  //Enable wake-up by console UART
    EMU_EnterEM2(true);
    GPIO_IntDisable(1<<1); //Disable wake-up by console UART
    // -----------------------------------------------
    jsiSetSleep(JSI_SLEEP_AWAKE);
  } else
#endif
  {
    JsSysTime sysTickTime;
#ifdef USE_RTC
    sysTickTime = averageSysTickTime*5/4;
#else
    sysTickTime = SYSTICK_RANGE*5/4;
#endif
    if (timeUntilWake < sysTickTime) {
      jstSetWakeUp(timeUntilWake);
    } else {
      // we're going to wake on a System Tick timer anyway, so don't bother
    }

    jsiSetSleep(JSI_SLEEP_ASLEEP);
    // -----------------------------------------------
    EMU_EnterEM1();
    // -----------------------------------------------
    jsiSetSleep(JSI_SLEEP_AWAKE);

    /* We may have woken up before the wakeup event. If so
    then make sure we clear the event */
    jstClearWakeUp();
    return true;
  }
  return false;
}

/// Reschedule the timer (it should already be running) to interrupt after 'period'
void jshUtilTimerReschedule(JsSysTime period) {

  utilTicks = period/(SYSCLK_FREQ*32);
  if (utilTicks < 2) utilTicks=2;
  if (utilTicks > 0xFFFFFFFF) utilTicks=0xFFFFFFFF;

  TIMER_CompareSet(TIMER0, 0, TIMER_CounterGet(TIMER0) + (utilTicks & 0xFFFF));
}

/// Start the timer and get it to interrupt after 'period'
void jshUtilTimerStart(JsSysTime period) {
  jshUtilTimerReschedule(period);
  TIMER_IntClear(TIMER0, TIMER_IFC_CC0);
  TIMER_IntEnable(TIMER0, TIMER_IEN_CC0);
}

/// Stop the timer
void jshUtilTimerDisable() {
  TIMER_IntDisable(TIMER0, TIMER_IEN_CC0);
}

// the temperature from the internal temperature sensor
JsVarFloat jshReadTemperature() {
  /* EFM32 TODO
  nrf_temp_init();

  NRF_TEMP->TASKS_START = 1;
  while (NRF_TEMP->EVENTS_DATARDY == 0) ;// Do nothing...
  NRF_TEMP->EVENTS_DATARDY = 0;
  int32_t nrf_temp = nrf_temp_read();
  NRF_TEMP->TASKS_STOP = 1;

  return nrf_temp / 4.0;
  */
  return 0;
}

// The voltage that a reading of 1 from `analogRead` actually represents
JsVarFloat jshReadVRef() {
  /* EFM32 TODO
  const nrf_adc_config_t nrf_adc_config =  {
       NRF_ADC_CONFIG_RES_10BIT,
       NRF_ADC_CONFIG_SCALING_INPUT_FULL_SCALE,
       NRF_ADC_CONFIG_REF_VBG }; // internal reference
  nrf_adc_configure( (nrf_adc_config_t *)&nrf_adc_config);
  return 1.2 / nrf_adc_convert_single(ADC_CONFIG_PSEL_AnalogInput0);
  */
  return 0;
}

/**
 * Get a random number - either using special purpose hardware or by
 * reading noise from an analog input. If unimplemented, this should
 * default to `rand()`
 */
unsigned int jshGetRandomNumber() {
  /* EFM32 TODO This is not random */
  return 1337;
}
